JohnDevine/ESP32-MQTT-Weather/src/main.c
/*
 * ESP32-MQTT-WEATHER Configurable Sensor System
 * 
 * This project implements an ESP32-based sensor monitoring system that reads
 * data from configurable sensors and publishes the measurements to an MQTT broker.
 * 
 * FEATURES:
 * - Runtime configurable sensor enable/disable through web interface
 * - Multiple sensor support with individual MQTT topics
 * - MQTT connectivity with automatic reconnection handling
 * - WiFi configuration with captive portal for easy setup
 * - Web-based configuration interface for all parameters
 * - Watchdog timer for system reliability
 * - Persistent configuration storage (NVS)
 * - Automatic version management and build automation
 * 
 * HARDWARE REQUIREMENTS:
 * - ESP32 development board
 * - Supported sensors: BH1750 (light), BME680 (environmental), etc.
 * - Pull-up resistors for I2C lines if using I2C (typically 4.7kΩ)
 * 
 * DATA OUTPUT:
 * - Combined JSON message with processor metrics and all enabled sensor data
 * - Individual sensor enable/disable configuration
 * - JSON format via MQTT for integration with home automation systems
 * 
 * CUSTOMIZATION POINTS:
 * Search for "TEMPLATE:" comments throughout the code to find areas that need
 * customization for your specific sensor(s) and use case.
 */

/*
 * CONDITIONAL LOGGING CONFIGURATION
 * 
 * To enable debug logging for this specific file, uncomment the line below.
 * This allows ESP_LOGD() calls to be compiled in and displayed when the 
 * global log level is set to DEBUG or VERBOSE.
 * 
 * Log Levels (from highest to lowest priority):
 * - ESP_LOG_ERROR   (E) - Error conditions
 * - ESP_LOG_WARN    (W) - Warning conditions  
 * - ESP_LOG_INFO    (I) - Informational messages
 * - ESP_LOG_DEBUG   (D) - Debug messages
 * - ESP_LOG_VERBOSE (V) - Verbose debug messages
 * 
 * To set global log level in menuconfig:
 * Component config > Log output > Default log verbosity
 * 
 * To set at runtime: esp_log_level_set("*", ESP_LOG_DEBUG);
 */
// #define LOG_LOCAL_LEVEL ESP_LOG_DEBUG

// Standard C input/output library
#include <stdio.h>
// FreeRTOS real-time operating system definitions
#include "freertos/FreeRTOS.h"
// FreeRTOS task management
#include "freertos/task.h"
// ESP32 GPIO driver
#include "driver/gpio.h"
// TEMPLATE: Include sensor-specific drivers here
// Examples:
// - I2C: #include "driver/i2c_master.h"
// - SPI: #include "driver/spi_master.h"
// - UART: #include "driver/uart.h"
// - ADC: #include "esp_adc/adc_oneshot.h"
#include "driver/i2c_master.h"  // Remove if not using I2C
// ESP-IDF logging library
#include "esp_log.h"
// Standard C string manipulation library (for memcmp)
#include <string.h> 

// Sensor configuration system
#include "sensor_config.h"

// Added for Wi-Fi and MQTT
#include "esp_wifi.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "lwip/err.h"
#include "lwip/sys.h"
#include "mqtt_client.h"
#include "cJSON.h" // For JSON formatting
#include "esp_spiffs.h"
#include "esp_system.h"
#include "esp_mac.h"
#include "esp_efuse.h"
#include "esp_http_server.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>
#include <errno.h>
#include "esp_chip_info.h"
#include "esp_ota_ops.h"
#include "esp_flash.h"
#include "spi_flash_mmap.h"
#include "project_version.h"  // Single source of truth for version
#include "esp_partition.h"
#include "esp_http_server.h"

// Watchdog timer includes
#include "esp_task_wdt.h"

// System monitoring includes
#include "esp_netif.h"

// Software watchdog variables
static uint32_t watchdog_timeout_ms = 0;  // Watchdog timeout (10× sample interval)
static TickType_t last_successful_publish = 0;  // Last successful MQTT publish time
static bool watchdog_enabled = false;  // Whether watchdog is enabled
static bool mqtt_publish_success = false;  // Flag for successful MQTT publish

// Debug logging flag - set to false to reduce log output (except watchdog logs)
static bool debug_logging = false;

#define WIFI_NVS_NAMESPACE "wifi_cfg"
#define WIFI_NVS_KEY_SSID "ssid"
#define WIFI_NVS_KEY_PASS "pass"
#define MQTT_NVS_KEY_URL "broker_url"
#define NVS_KEY_SAMPLE_INTERVAL "sample_interval"
#define NVS_KEY_DATA_TOPIC "data_topic"
#define NVS_KEY_WATCHDOG_COUNTER "watchdog_cnt"
#define DEFAULT_WIFI_SSID "yourSSID"
#define DEFAULT_WIFI_PASS "yourpassword"
// Temporary: Using public test broker - change this to your local broker once network is confirmed
#define DEFAULT_MQTT_BROKER_URL "mqtt://test.mosquitto.org:1883"
// Original: #define DEFAULT_MQTT_BROKER_URL "mqtt://192.168.1.100"
#define DEFAULT_SAMPLE_INTERVAL 5000L

static char wifi_ssid[33] = DEFAULT_WIFI_SSID;
static char wifi_pass[65] = DEFAULT_WIFI_PASS;
static char mqtt_broker_url[128] = DEFAULT_MQTT_BROKER_URL;
// TEMPLATE: Update default topic name for your sensor type
char data_topic[41] = "Data/Sensor";  // Default MQTT topic for sensor data
static long sample_interval_ms = DEFAULT_SAMPLE_INTERVAL;
static uint32_t watchdog_reset_counter = 0;  // Watchdog timer reset counter

#define BOOT_BTN_GPIO GPIO_NUM_0

// Note: I2C configuration is now handled by the sensor modules in the sensor_config system
// The original template I2C defines have been removed since we use the configurable sensor system

// Tag used for logging messages from this module
static const char *TAG = "DATA_READER";

// Wi-Fi Configuration
#define EXAMPLE_ESP_MAXIMUM_RETRY  5

// MQTT Configuration
#define MQTT_BROKER_URL "mqtt://192.168.1.5"

// Global variable for MQTT client
static esp_mqtt_client_handle_t mqtt_client;
static int wifi_retry_num = 0;

// PutInputCodeHere: Define your protocol-specific data structures here
// Example: If you need to store parsed fields from your input data
// typedef struct {
//     uint8_t id;
//     uint32_t value;
//     char strval[48];
//     int is_ascii;
// } parsed_field_t;
// #define MAX_PARSED_FIELDS 32
// static parsed_field_t parsed_fields[MAX_PARSED_FIELDS];
// static int parsed_fields_count = 0;

