JohnDevine/ESP32-MQTT-Weather/src/main.c
// Forward declarations for functions defined later in this file

// Forward declarations for NVS functions
static void load_watchdog_counter_from_nvs(void);
static void save_watchdog_counter_to_nvs(void);

// Forward declarations for system info functions
static int32_t get_wifi_rssi_percent(void);
static char* get_ip_address(void);
static float get_cpu_temperature(void);
static char* get_software_version(void);
static char* get_chip_id(void);

// Forward declaration for DNS hijack task
void dns_hijack_task(void *pvParameter);

void url_decode(char *dst, const char *src, size_t dstsize);

// Forward declarations for HTTP handlers
static esp_err_t params_json_get_handler(httpd_req_t *req);
static esp_err_t params_update_post_handler(httpd_req_t *req);
static esp_err_t parameters_html_handler(httpd_req_t *req);
static esp_err_t captive_redirect_handler(httpd_req_t *req);
static esp_err_t sysinfo_json_get_handler(httpd_req_t *req);
static esp_err_t ota_firmware_handler(httpd_req_t *req);
static esp_err_t ota_filesystem_handler(httpd_req_t *req);

// New forward declarations for Wi-Fi and MQTT
static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data);
static void mqtt_event_handler(void* arg, esp_event_base_t event_base,
                               int32_t event_id, void* event_data);
static bool test_mqtt_broker_connectivity(const char* broker_url);
static bool check_wifi_connection(void);
void wifi_init_sta(void);
static void mqtt_app_start(void);
void publish_sensor_data_mqtt(const char* topic, const char* json_data); // Legacy function (kept for compatibility)
void publish_combined_sensor_mqtt(const char* topic, const char* json_data); // Publish combined sensor data to main topic

// Forward declaration for DNS hijack task
void dns_hijack_task(void *pvParameter);

// Helper function to extract a 16-bit unsigned integer from a buffer.
// Assumes big-endian byte order (most significant byte first).
// buffer: Pointer to the byte array.
// offset: Starting index in the buffer from where to read the 16-bit integer.
// Returns the extracted 16-bit unsigned integer.
uint16_t unpack_u16_be(const uint8_t *buffer, int offset) {
    // Combine two consecutive bytes into a 16-bit value.
    // buffer[offset] is the most significant byte, buffer[offset+1] is the least significant.
    return ((uint16_t)buffer[offset] << 8) | buffer[offset + 1];
}

// Helper function to extract an 8-bit unsigned integer (a single byte) from a buffer.
// buffer: Pointer to the byte array.
// offset: Index in the buffer from where to read the 8-bit integer.
// Returns the extracted 8-bit unsigned integer.
uint8_t unpack_u8(const uint8_t *buffer, int offset) {
    // Directly return the byte at the specified offset.
    return buffer[offset];
}

// TEMPLATE: Main sensor data reading function
// Replace this function with your specific sensor reading logic
// Function to read all enabled sensors and publish combined data
static bool read_sensor_data() {
    ESP_LOGI(TAG, "Reading enabled sensors...");
    
    bool any_sensor_successful = false;
    cJSON *combined_json = cJSON_CreateObject();
    cJSON *processor_json = cJSON_CreateObject();
    cJSON *sensors_json = cJSON_CreateObject();
    
    if (!combined_json || !processor_json || !sensors_json) {
        ESP_LOGE(TAG, "Failed to create JSON objects");
        if (combined_json) cJSON_Delete(combined_json);
        if (processor_json) cJSON_Delete(processor_json);
        if (sensors_json) cJSON_Delete(sensors_json);
        return false;
    }
    
    // Add processor metrics (system information)
    int32_t wifi_rssi_percent = get_wifi_rssi_percent();
    cJSON_AddNumberToObject(processor_json, "WiFiRSSI", wifi_rssi_percent);
    
    char *ip_address = get_ip_address();
    cJSON_AddStringToObject(processor_json, "IPAddress", ip_address);
    
    float cpu_temp = get_cpu_temperature();
    cJSON_AddNumberToObject(processor_json, "CPUTemperature", cpu_temp);
    
    char *software_version = get_software_version();
    cJSON_AddStringToObject(processor_json, "SoftwareVersion", software_version);
    
    char *chip_id = get_chip_id();
    cJSON_AddStringToObject(processor_json, "ChipID", chip_id);
    
    cJSON_AddNumberToObject(processor_json, "WDTRestartCount", watchdog_reset_counter);
    
    // Iterate through all sensor types and read enabled ones
    for (int i = 0; i < SENSOR_TYPE_MAX_COUNT; i++) {
        sensor_type_t sensor_type = (sensor_type_t)i;
        
        if (!sensor_config_is_enabled(sensor_type)) {
            ESP_LOGD(TAG, "Sensor %s is disabled, skipping", sensor_config_get_name(sensor_type));
            continue;
        }
        
        ESP_LOGI(TAG, "Reading %s sensor...", sensor_config_get_name(sensor_type));
        
        sensor_data_t sensor_data;
        esp_err_t read_result = ESP_FAIL;
        
        // Read sensor based on type
        switch (sensor_type) {
            case SENSOR_TYPE_BH1750:
                read_result = sensor_bh1750_read(&sensor_data);
                break;
                
            case SENSOR_TYPE_BME680:
                read_result = sensor_bme680_read(&sensor_data);
                break;
                
            case SENSOR_TYPE_DHT22:
                // TODO: Implement DHT22 reading
                ESP_LOGW(TAG, "DHT22 reading not yet implemented");
                continue;
                
            case SENSOR_TYPE_DS18B20:
                // TODO: Implement DS18B20 reading
                ESP_LOGW(TAG, "DS18B20 reading not yet implemented");
                continue;
                
            case SENSOR_TYPE_BME280:
                // TODO: Implement BME280 reading
                ESP_LOGW(TAG, "BME280 reading not yet implemented");
                continue;
                
            default:
                ESP_LOGW(TAG, "Unknown sensor type: %d", sensor_type);
                continue;
        }
        
        if (read_result == ESP_OK && sensor_data.valid) {
            // Add sensor data to the combined JSON
            cJSON *sensor_obj = cJSON_CreateObject();
            if (sensor_obj) {
                // Add sensor metadata
                cJSON_AddStringToObject(sensor_obj, "name", sensor_config_get_name(sensor_type));
                cJSON_AddBoolToObject(sensor_obj, "valid", sensor_data.valid);
                
                // Add sensor-specific data
                switch (sensor_type) {
                    case SENSOR_TYPE_BH1750:
                        cJSON_AddNumberToObject(sensor_obj, "lux", sensor_data.data.bh1750.lux);
                        cJSON_AddItemToObject(sensors_json, "bh1750", sensor_obj);
                        break;
                        
                    case SENSOR_TYPE_BME680:
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.bme680.temperature);
                        cJSON_AddNumberToObject(sensor_obj, "humidity", sensor_data.data.bme680.humidity);
                        cJSON_AddNumberToObject(sensor_obj, "pressure", sensor_data.data.bme680.pressure);
                        cJSON_AddNumberToObject(sensor_obj, "gas_resistance", sensor_data.data.bme680.gas_resistance);
                        cJSON_AddItemToObject(sensors_json, "bme680", sensor_obj);
                        break;
                        
                    case SENSOR_TYPE_DHT22:
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.dht22.temperature);
                        cJSON_AddNumberToObject(sensor_obj, "humidity", sensor_data.data.dht22.humidity);
                        cJSON_AddItemToObject(sensors_json, "dht22", sensor_obj);
                        break;
                        
                    case SENSOR_TYPE_DS18B20:
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.ds18b20.temperature);
                        cJSON_AddItemToObject(sensors_json, "ds18b20", sensor_obj);
                        break;
                        
                    case SENSOR_TYPE_BME280:
                        cJSON_AddNumberToObject(sensor_obj, "temperature", sensor_data.data.bme280.temperature);
                        cJSON_AddNumberToObject(sensor_obj, "humidity", sensor_data.data.bme280.humidity);
                        cJSON_AddNumberToObject(sensor_obj, "pressure", sensor_data.data.bme280.pressure);
                        cJSON_AddItemToObject(sensors_json, "bme280", sensor_obj);
                        break;
                        
                    default:
                        cJSON_Delete(sensor_obj);
                        continue;
                }
                
                any_sensor_successful = true;
                ESP_LOGI(TAG, "%s sensor reading successful", sensor_config_get_name(sensor_type));
            }
        } else {
            ESP_LOGE(TAG, "%s sensor reading failed", sensor_config_get_name(sensor_type));
        }
    }
    
    // Combine processor and sensor data
    cJSON_AddItemToObject(combined_json, "processor", processor_json);
    cJSON_AddItemToObject(combined_json, "sensors", sensors_json);
    
    // Publish the combined message to the main data topic
    char *json_string = cJSON_PrintUnformatted(combined_json);
    if (json_string && any_sensor_successful) {
        publish_combined_sensor_mqtt(data_topic, json_string);
        ESP_LOGI(TAG, "Combined sensor data published successfully");
        free(json_string);
        cJSON_Delete(combined_json);
        return true;
    } else {
        ESP_LOGW(TAG, "No sensor data to publish or JSON creation failed");
        if (json_string) free(json_string);
        cJSON_Delete(combined_json);
        return false;
    }
}

