JohnDevine/ESP32-MQTT-Weather/src/main.c
// SPIFFS init
void init_spiffs() {
    ESP_LOGI(TAG, "Initializing SPIFFS...");
    esp_vfs_spiffs_conf_t conf = {
        .base_path = "/spiffs",
        .partition_label = NULL,
        .max_files = 5,
        .format_if_mount_failed = true
    };
    
    ESP_ERROR_CHECK(esp_vfs_spiffs_register(&conf));
    
    size_t total = 0, used = 0;
    esp_err_t ret = esp_spiffs_info(NULL, &total, &used);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret));
    } else {
        ESP_LOGI(TAG, "SPIFFS: %d kB total, %d kB used", total / 1024, used / 1024);
    }
}

// HTTP handler for /params.json
esp_err_t params_json_get_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "=== PARAMS.JSON REQUEST ===");
    
    // Debug: Show counter before reloading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter before reload: %lu ***", watchdog_reset_counter);
    
    // Reload watchdog counter from NVS to ensure latest value is displayed
    load_watchdog_counter_from_nvs();
    
    // Debug: Show counter after reloading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after reload: %lu ***", watchdog_reset_counter);
    
    ESP_LOGI(TAG, "Current data_topic variable: '%s'", data_topic);
    ESP_LOGI(TAG, "Current wifi_ssid: '%s'", wifi_ssid);
    ESP_LOGI(TAG, "Current mqtt_broker_url: '%s'", mqtt_broker_url);
    ESP_LOGI(TAG, "Current sample_interval_ms: %ld", sample_interval_ms);
    ESP_LOGI(TAG, "Current watchdog_reset_counter: %lu", watchdog_reset_counter);
    
    // Create JSON response with sensor configuration
    cJSON *json = cJSON_CreateObject();
    cJSON *sensors = cJSON_CreateObject();
    
    // Basic configuration
    cJSON_AddStringToObject(json, "ssid", wifi_ssid);
    cJSON_AddStringToObject(json, "password", wifi_pass);
    cJSON_AddStringToObject(json, "mqtt_url", mqtt_broker_url);
    cJSON_AddNumberToObject(json, "sample_interval", sample_interval_ms);
    cJSON_AddStringToObject(json, "data_topic", data_topic);
    cJSON_AddNumberToObject(json, "watchdog_reset_counter", watchdog_reset_counter);
    
    // Sensor configurations
    for (int i = 0; i < SENSOR_TYPE_MAX_COUNT; i++) {
        sensor_config_t *config = sensor_config_get((sensor_type_t)i);
        if (config) {
            cJSON *sensor_obj = cJSON_CreateObject();
            cJSON_AddBoolToObject(sensor_obj, "enabled", config->enabled);
            cJSON_AddStringToObject(sensor_obj, "name", config->name);
            
            // Add sensor-specific objects
            switch (i) {
                case SENSOR_TYPE_BH1750:
                    cJSON_AddItemToObject(sensors, "bh1750", sensor_obj);
                    break;
                case SENSOR_TYPE_BME680:
                    cJSON_AddItemToObject(sensors, "bme680", sensor_obj);
                    break;
                case SENSOR_TYPE_DHT22:
                    cJSON_AddItemToObject(sensors, "dht22", sensor_obj);
                    break;
                case SENSOR_TYPE_DS18B20:
                    cJSON_AddItemToObject(sensors, "ds18b20", sensor_obj);
                    break;
                case SENSOR_TYPE_BME280:
                    cJSON_AddItemToObject(sensors, "bme280", sensor_obj);
                    break;
                default:
                    cJSON_Delete(sensor_obj); // Clean up unused sensor object
                    break;
            }
        }
    }
    
    cJSON_AddItemToObject(json, "sensors", sensors);
    
    char *json_string = cJSON_Print(json);
    ESP_LOGI(TAG, "Sending params.json response: %s", json_string);
    
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json_string, HTTPD_RESP_USE_STRLEN);
    
    free(json_string);
    cJSON_Delete(json);
    
    ESP_LOGI(TAG, "=== PARAMS.JSON RESPONSE SENT ===");
    return ESP_OK;
}

// Global flag to signal shutdown
static bool system_shutting_down = false;

// Reboot task function
static void reboot_task(void *param) {
    ESP_LOGI(TAG, "Reboot task started, shutting down gracefully...");
    
    // Set shutdown flag to signal other tasks to stop
    system_shutting_down = true;
    
    // Give time for HTTP response to complete
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    
    ESP_LOGI(TAG, "Disabling task watchdog before restart...");
    esp_task_wdt_deinit();
    
    // Give a bit more time for tasks to see the shutdown flag
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    
    ESP_LOGI(TAG, "Performing system restart NOW...");
    fflush(stdout);  // Ensure log message is sent
    
    esp_restart();
    
    // This line should never be reached
    vTaskDelete(NULL);
}

// HTTP handler for /update (POST)
esp_err_t params_update_post_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "=== UPDATE REQUEST RECEIVED ===");
    
    char buf[512];
    int ret = httpd_req_recv(req, buf, sizeof(buf)-1);
    if (ret <= 0) {
        ESP_LOGE(TAG, "Failed to receive update data");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    buf[ret] = 0;
    
    ESP_LOGI(TAG, "Received update data: %s", buf);
    
    char ssid[33] = "", pass[65] = "", mqtt_url[128] = "";
    long interval = 5000;
    sscanf(strstr(buf, "ssid=")+5, "%32[^&]", ssid);
    sscanf(strstr(buf, "password=")+9, "%64[^&]", pass);
    sscanf(strstr(buf, "mqtt_url=")+9, "%127[^&]", mqtt_url);
    sscanf(strstr(buf, "sample_interval=")+15, "%ld", &interval);  // Fixed: "sample_interval=" is 15 chars, not 16
    // Decode URL-encoded values
    char ssid_dec[33], pass_dec[65], url_dec[128];
    url_decode(ssid_dec, ssid, sizeof(ssid_dec));
    url_decode(pass_dec, pass, sizeof(pass_dec));
    url_decode(url_dec, mqtt_url, sizeof(url_dec));
    strncpy(wifi_ssid, ssid_dec, sizeof(wifi_ssid)-1);
    strncpy(wifi_pass, pass_dec, sizeof(wifi_pass)-1);
    strncpy(mqtt_broker_url, url_dec, sizeof(mqtt_broker_url)-1);
    sample_interval_ms = interval;
    // Save to NVS
    nvs_handle_t nvs_handle;
    nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    nvs_set_str(nvs_handle, WIFI_NVS_KEY_SSID, wifi_ssid);
    nvs_set_str(nvs_handle, WIFI_NVS_KEY_PASS, wifi_pass);
    nvs_set_str(nvs_handle, MQTT_NVS_KEY_URL, mqtt_broker_url);
    nvs_set_i64(nvs_handle, NVS_KEY_SAMPLE_INTERVAL, (int64_t)sample_interval_ms);
    // Handle Data topic
    ESP_LOGI(TAG, "=== PROCESSING DATA TOPIC ===");
    ESP_LOGI(TAG, "Current data_topic before update: '%s'", data_topic);
    
    char data_topic_in[41] = "";
    char data_topic_dec[41];
    char *data_topic_ptr = strstr(buf, "data_topic=");
    if (data_topic_ptr) {
        sscanf(data_topic_ptr + 11, "%40[^&]", data_topic_in);  // Fixed: "data_topic=" is 11 chars, not 10
        ESP_LOGI(TAG, "Raw Data topic from form: '%s'", data_topic_in);
        
