JohnDevine/ESP32-MQTT-Weather/src/main.c
        url_decode(data_topic_dec, data_topic_in, sizeof(data_topic_dec));
        ESP_LOGI(TAG, "URL decoded Data topic: '%s'", data_topic_dec);
        
        strncpy(data_topic, data_topic_dec, sizeof(data_topic)-1);
        data_topic[sizeof(data_topic)-1] = '\0';
        ESP_LOGI(TAG, "Data topic updated to: '%s'", data_topic);
    } else {
        ESP_LOGW(TAG, "No data_topic found in request data: %s", buf);
    }
    
    esp_err_t nvs_err = nvs_set_str(nvs_handle, NVS_KEY_DATA_TOPIC, data_topic);
    ESP_LOGI(TAG, "Saved Data topic '%s' to NVS with key '%s': %s", data_topic, NVS_KEY_DATA_TOPIC, esp_err_to_name(nvs_err));
    ESP_LOGI(TAG, "=== DATA TOPIC PROCESSING COMPLETE ===");
    
    ESP_LOGI(TAG, "=== PARAMETER UPDATE PROCESSING COMPLETE ===");
    
    // Handle Watchdog Reset Counter
    ESP_LOGI(TAG, "=== PROCESSING WATCHDOG RESET COUNTER ===");
    ESP_LOGI(TAG, "Current watchdog_reset_counter before update: %lu", watchdog_reset_counter);
    
    char *watchdog_counter_ptr = strstr(buf, "watchdog_reset_counter=");
    if (watchdog_counter_ptr) {
        uint32_t counter_value = 0;
        sscanf(watchdog_counter_ptr + 23, "%lu", &counter_value);
        ESP_LOGI(TAG, "Watchdog counter from form: %lu", counter_value);
        
        watchdog_reset_counter = counter_value;
        ESP_LOGI(TAG, "Watchdog reset counter updated to: %lu", watchdog_reset_counter);
    } else {
        ESP_LOGW(TAG, "No watchdog_reset_counter found in request data: %s", buf);
    }
    
    esp_err_t watchdog_nvs_err = nvs_set_u32(nvs_handle, NVS_KEY_WATCHDOG_COUNTER, watchdog_reset_counter);
    ESP_LOGI(TAG, "Saved watchdog counter %lu to NVS with key '%s': %s", watchdog_reset_counter, NVS_KEY_WATCHDOG_COUNTER, esp_err_to_name(watchdog_nvs_err));
    ESP_LOGI(TAG, "=== WATCHDOG RESET COUNTER PROCESSING COMPLETE ===");
    
    // Handle Sensor Configuration Updates
    ESP_LOGI(TAG, "=== PROCESSING SENSOR CONFIGURATIONS ===");
    
    // BH1750 Light Sensor
    if (strstr(buf, "sensor_bh1750_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_BH1750, true);
        ESP_LOGI(TAG, "BH1750 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_BH1750, false);
        ESP_LOGI(TAG, "BH1750 sensor disabled");
    }
    
    char *bh1750_name_ptr = strstr(buf, "sensor_bh1750_name=");
    if (bh1750_name_ptr) {
        char name_in[32], name_dec[32];
        sscanf(bh1750_name_ptr + 19, "%31[^&]", name_in);
        url_decode(name_dec, name_in, sizeof(name_dec));
        sensor_config_set_name(SENSOR_TYPE_BH1750, name_dec);
        ESP_LOGI(TAG, "BH1750 name set to: '%s'", name_dec);
    }
    
    // BME680 Environmental Sensor
    if (strstr(buf, "sensor_bme680_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_BME680, true);
        ESP_LOGI(TAG, "BME680 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_BME680, false);
        ESP_LOGI(TAG, "BME680 sensor disabled");
    }
    
    char *bme680_topic_ptr = strstr(buf, "sensor_bme680_topic=");
    if (bme680_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(bme680_topic_ptr + 20, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_BME680, topic_dec);
        ESP_LOGI(TAG, "BME680 topic set to: '%s'", topic_dec);
    }
    
    // DHT22 Temperature/Humidity
    if (strstr(buf, "sensor_dht22_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_DHT22, true);
        ESP_LOGI(TAG, "DHT22 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_DHT22, false);
        ESP_LOGI(TAG, "DHT22 sensor disabled");
    }
    
    char *dht22_topic_ptr = strstr(buf, "sensor_dht22_topic=");
    if (dht22_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(dht22_topic_ptr + 19, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_DHT22, topic_dec);
        ESP_LOGI(TAG, "DHT22 topic set to: '%s'", topic_dec);
    }
    
    // DS18B20 Temperature
    if (strstr(buf, "sensor_ds18b20_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_DS18B20, true);
        ESP_LOGI(TAG, "DS18B20 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_DS18B20, false);
        ESP_LOGI(TAG, "DS18B20 sensor disabled");
    }
    
    char *ds18b20_topic_ptr = strstr(buf, "sensor_ds18b20_topic=");
    if (ds18b20_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(ds18b20_topic_ptr + 21, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_DS18B20, topic_dec);
        ESP_LOGI(TAG, "DS18B20 topic set to: '%s'", topic_dec);
    }
    
    // BME280 Climate
    if (strstr(buf, "sensor_bme280_enabled=on")) {
        sensor_config_set_enabled(SENSOR_TYPE_BME280, true);
        ESP_LOGI(TAG, "BME280 sensor enabled");
    } else {
        sensor_config_set_enabled(SENSOR_TYPE_BME280, false);
        ESP_LOGI(TAG, "BME280 sensor disabled");
    }
    
    char *bme280_topic_ptr = strstr(buf, "sensor_bme280_topic=");
    if (bme280_topic_ptr) {
        char topic_in[64], topic_dec[64];
        sscanf(bme280_topic_ptr + 20, "%63[^&]", topic_in);
        url_decode(topic_dec, topic_in, sizeof(topic_dec));
        sensor_config_set_mqtt_topic(SENSOR_TYPE_BME280, topic_dec);
        ESP_LOGI(TAG, "BME280 topic set to: '%s'", topic_dec);
    }
    
    // Save sensor configuration to NVS
    esp_err_t sensor_save_err = sensor_config_save_to_nvs();
    ESP_LOGI(TAG, "Sensor configuration save result: %s", esp_err_to_name(sensor_save_err));
    ESP_LOGI(TAG, "=== SENSOR CONFIGURATIONS PROCESSING COMPLETE ===");
    
    nvs_commit(nvs_handle);
    nvs_close(nvs_handle);
    
    ESP_LOGI(TAG, "Configuration saved successfully. Sending response...");
    httpd_resp_sendstr(req, "Saved. Rebooting...");
    
