JohnDevine/ESP32-MQTT-Weather/src/main.c
    ESP_LOGI(TAG, "Response sent. Starting reboot sequence...");
    // Give the HTTP response time to be sent
    vTaskDelay(500 / portTICK_PERIOD_MS);
    
    // Schedule reboot in a separate task to avoid blocking the HTTP response
    ESP_LOGI(TAG, "Creating reboot task...");
    BaseType_t task_created = xTaskCreate(reboot_task, "reboot_task", 2048, NULL, 1, NULL);
    if (task_created == pdPASS) {
        ESP_LOGI(TAG, "Reboot task created successfully");
    } else {
        ESP_LOGE(TAG, "Failed to create reboot task");
    }
    
    return ESP_OK;
}

// HTTP handler for /parameters.html
esp_err_t parameters_html_handler(httpd_req_t *req) {
    FILE *f = fopen("/spiffs/parameters.html", "r");
    if (!f) {
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }
    char buf[512];
    httpd_resp_set_type(req, "text/html");
    size_t n;
    while ((n = fread(buf, 1, sizeof(buf), f)) > 0) {
        httpd_resp_send_chunk(req, buf, n);
    }
    fclose(f);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

// Captive portal redirect handler
esp_err_t captive_redirect_handler(httpd_req_t *req) {
    ESP_LOGD(TAG, "Captive portal request: %s", req->uri);
    
    // If the request is already for /parameters.html, serve it directly
    if (strcmp(req->uri, "/parameters.html") == 0) {
        return parameters_html_handler(req);
    }
    
    // Check for other valid endpoints and serve them directly
    if (strcmp(req->uri, "/params.json") == 0) {
        return params_json_get_handler(req);
    }
    if (strcmp(req->uri, "/sysinfo.json") == 0) {
        return sysinfo_json_get_handler(req);
    }
    if (strcmp(req->uri, "/update") == 0) {
        return params_update_post_handler(req);
    }
    
    // For any other request, redirect to the configuration page
    ESP_LOGD(TAG, "Redirecting %s to /parameters.html", req->uri);
    
    const char* redirect_html = 
        "<!DOCTYPE html>\n"
        "<html>\n"
        "<head>\n"
        "<meta charset=\"UTF-8\">\n"
        "<title>ESP32 Configuration</title>\n"
        "<meta http-equiv=\"refresh\" content=\"0; url=/parameters.html\">\n"
        "</head>\n"
        "<body>\n"
        "<p>Redirecting to configuration page...</p>\n"
        "<p>If you are not redirected automatically, <a href=\"/parameters.html\">click here</a>.</p>\n"
        "</body>\n"
        "</html>";
    
    httpd_resp_set_status(req, "200 OK");
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    httpd_resp_set_hdr(req, "Expires", "0");
    httpd_resp_send(req, redirect_html, strlen(redirect_html));
    
    return ESP_OK;
}

// Handler for /sysinfo.json
static esp_err_t sysinfo_json_get_handler(httpd_req_t *req) {
    char resp[512];
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    // Use esp_app_get_description if available, else fallback
    #if ESP_IDF_VERSION_MAJOR >= 5
    const esp_app_desc_t *app_desc = esp_app_get_description();
    #else
    const esp_app_desc_t *app_desc = esp_ota_get_app_description();
    #endif
    const char *idf_ver = esp_get_idf_version();
    
    // Use version from single source of truth (project_version.h)
    const char *version_str = PROJECT_VERSION;
    
    esp_reset_reason_t reason = esp_reset_reason();
    const char *reason_str = "Unknown";
    switch (reason) {
        case ESP_RST_POWERON: reason_str = "Power-on"; break;
        case ESP_RST_EXT: reason_str = "External"; break;
        case ESP_RST_SW: reason_str = "Software"; break;
        case ESP_RST_PANIC: reason_str = "Panic"; break;
        case ESP_RST_INT_WDT: reason_str = "Interrupt WDT"; break;
        case ESP_RST_TASK_WDT: reason_str = "Task WDT"; break;
        case ESP_RST_WDT: reason_str = "Other WDT"; break;
        case ESP_RST_DEEPSLEEP: reason_str = "Deep Sleep"; break;
        case ESP_RST_BROWNOUT: reason_str = "Brownout"; break;
        case ESP_RST_SDIO: reason_str = "SDIO"; break;
        default: break;
    }
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char chip_id[18];
    snprintf(chip_id, sizeof(chip_id), "%02X%02X%02X%02X%02X%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    // Get flash chip information
    uint32_t flash_id = 0x000000; // Placeholder
    uint32_t flash_size = 0;
    
    // Get actual flash size - ESP32 DevKit V1 typically has 4MB
    // Use the more reliable method of checking all partitions to estimate total flash
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
    uint32_t max_offset = 0;
    while (it != NULL) {
        const esp_partition_t *partition = esp_partition_get(it);
        uint32_t partition_end = partition->address + partition->size;
        if (partition_end > max_offset) {
            max_offset = partition_end;
        }
        it = esp_partition_next(it);
    }
    if (it) esp_partition_iterator_release(it);
    
    // Round up to nearest MB and ensure it's at least 4MB for ESP32 DevKit V1
    if (max_offset > 0) {
        flash_size = ((max_offset + 1024*1024 - 1) / (1024*1024)) * 1024*1024; // Round up to nearest MB
        if (flash_size < 4*1024*1024) flash_size = 4*1024*1024; // Minimum 4MB for ESP32 DevKit V1
    } else {
        flash_size = 4 * 1024 * 1024; // Default 4MB for ESP32 DevKit V1
    }
    snprintf(resp, sizeof(resp),
        "{"
        "\"version\":\"%s\","  // Program Version
        "\"build\":\"%s %s\"," // Build Date & Time
        "\"sdk\":\"%s\","      // Core/SDK Version
        "\"restart_reason\":\"%s\"," // Restart Reason
        "\"chip_id\":\"%s\","  // ESP Chip Id
        "\"flash_id\":\"%06lX\"," // Flash Chip Id
        "\"flash_size\":\"%lu KB\""
        "}",
        version_str,  // Use version from version.txt file
        app_desc->date, app_desc->time,
        idf_ver,
        reason_str,
        chip_id,
        (unsigned long)(flash_id & 0xFFFFFF),
        (unsigned long)(flash_size / 1024)
    );
    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, resp, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

// OTA Firmware Update Handler
static esp_err_t ota_firmware_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "OTA firmware handler called - Content-Length: %d", req->content_len);
    ESP_LOGI(TAG, "Request method: %d, URI: %s", req->method, req->uri);
    
    // Add CORS headers
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "POST, OPTIONS");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type");
    
