JohnDevine/ESP32-MQTT-Weather/src/main.c
    // Stop DHCP server before configuring IP
    esp_netif_dhcps_stop(ap_netif);
    
    esp_netif_ip_info_t ip_info;
    ip_info.ip.addr = esp_ip4addr_aton("192.168.4.1");
    ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
    ip_info.gw.addr = esp_ip4addr_aton("192.168.4.1");
    ESP_ERROR_CHECK(esp_netif_set_ip_info(ap_netif, &ip_info));
    
    // Configure DHCP server options
    esp_netif_dhcps_option(ap_netif, ESP_NETIF_OP_SET, ESP_NETIF_DOMAIN_NAME_SERVER, &ip_info.ip, sizeof(ip_info.ip));
    
    esp_netif_dhcps_start(ap_netif);

    ESP_ERROR_CHECK(esp_wifi_start());
    ESP_LOGI(TAG, "WiFi AP started: %s (IP: 192.168.4.1)", ap_ssid);
    
    // Wait a moment for WiFi to stabilize
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    // Start SPIFFS
    ESP_LOGI(TAG, "About to call init_spiffs()...");
    init_spiffs();
    ESP_LOGI(TAG, "init_spiffs() completed successfully");
    
    // Start HTTP server
    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.uri_match_fn = httpd_uri_match_wildcard;
    config.max_uri_handlers = 16;  // Increase limit
    config.stack_size = 8192;      // Increase stack size
    
    // Configure for large file uploads (OTA)
    config.recv_wait_timeout = 120;     // 2 minutes timeout for receiving data
    config.send_wait_timeout = 120;     // 2 minutes timeout for sending data
    config.lru_purge_enable = true;     // Enable LRU purging of connections
    config.max_open_sockets = 4;        // Limit concurrent connections
    config.backlog_conn = 2;            // Reduce backlog
    
    ESP_LOGI(TAG, "HTTP server config: recv_timeout=%d, send_timeout=%d, max_sockets=%d", 
             config.recv_wait_timeout, config.send_wait_timeout, config.max_open_sockets);
    
    esp_err_t server_err = httpd_start(&server, &config);
    if (server_err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start HTTP server: %s", esp_err_to_name(server_err));
        return;
    }
    
    ESP_LOGI(TAG, "HTTP server started successfully");
    
    // Register handlers in order of specificity (most specific first)
    httpd_uri_t params_json = { .uri = "/params.json", .method = HTTP_GET, .handler = params_json_get_handler, .user_ctx = NULL };
    httpd_uri_t params_update = { .uri = "/update", .method = HTTP_POST, .handler = params_update_post_handler, .user_ctx = NULL };
    httpd_uri_t parameters_html = { .uri = "/parameters.html", .method = HTTP_GET, .handler = parameters_html_handler, .user_ctx = NULL };
    httpd_uri_t sysinfo_json = { .uri = "/sysinfo.json", .method = HTTP_GET, .handler = sysinfo_json_get_handler, .user_ctx = NULL };
    httpd_uri_t ota_firmware = { .uri = "/ota/firmware", .method = HTTP_POST, .handler = ota_firmware_handler, .user_ctx = NULL };
    httpd_uri_t ota_filesystem = { .uri = "/ota/filesystem", .method = HTTP_POST, .handler = ota_filesystem_handler, .user_ctx = NULL };
    httpd_uri_t ota_firmware_options = { .uri = "/ota/firmware", .method = HTTP_OPTIONS, .handler = ota_firmware_handler, .user_ctx = NULL };
    httpd_uri_t ota_filesystem_options = { .uri = "/ota/filesystem", .method = HTTP_OPTIONS, .handler = ota_filesystem_handler, .user_ctx = NULL };
    
    // Register specific handlers first
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &params_json));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &params_update));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &parameters_html));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &sysinfo_json));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_firmware));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_filesystem));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_firmware_options));
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &ota_filesystem_options));
    
    // Register wildcard handler last to catch all other requests
    httpd_uri_t captive = { .uri = "/*", .method = HTTP_GET, .handler = captive_redirect_handler, .user_ctx = NULL };
    ESP_ERROR_CHECK(httpd_register_uri_handler(server, &captive));
    
    ESP_LOGI(TAG, "All HTTP handlers registered successfully");
    ESP_LOGI(TAG, "Captive portal ready - connect to '%s' and visit any website", ap_ssid);
}

void ap_config_task(void *pvParameter) {
    ESP_LOGI(TAG, "Starting AP configuration mode...");
    
    // Debug: Show watchdog counter before loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter before NVS load (AP mode): %lu ***", watchdog_reset_counter);
    
    // Load NVS values before starting AP and HTTP server
    load_wifi_config_from_nvs();
    load_mqtt_config_from_nvs();
    load_sample_interval_from_nvs();
    load_data_topic_from_nvs();
    load_watchdog_counter_from_nvs();
    
    // Initialize the configurable sensor system
    ESP_LOGI(TAG, "Initializing configurable sensor system...");
    esp_err_t sensor_init_err = sensor_config_init();
    if (sensor_init_err == ESP_OK) {
        ESP_LOGI(TAG, "Sensor configuration system initialized successfully");
        
        // Initialize enabled sensors
        if (sensor_config_is_enabled(SENSOR_TYPE_BH1750)) {
            esp_err_t bh1750_err = sensor_bh1750_init();
            if (bh1750_err == ESP_OK) {
                ESP_LOGI(TAG, "BH1750 sensor initialized successfully");
            } else {
                ESP_LOGE(TAG, "BH1750 sensor initialization failed: %s", esp_err_to_name(bh1750_err));
            }
        }
        
        if (sensor_config_is_enabled(SENSOR_TYPE_BME680)) {
            esp_err_t bme680_err = sensor_bme680_init();
            if (bme680_err == ESP_OK) {
                ESP_LOGI(TAG, "BME680 sensor initialized successfully");
            } else {
                ESP_LOGE(TAG, "BME680 sensor initialization failed: %s", esp_err_to_name(bme680_err));
            }
        }
    } else {
        ESP_LOGE(TAG, "Sensor configuration system initialization failed: %s", esp_err_to_name(sensor_init_err));
    }
    
    // Debug: Show watchdog counter after loading from NVS
    ESP_LOGI(TAG, "*** DEBUG: watchdog_reset_counter after NVS load (AP mode): %lu ***", watchdog_reset_counter);
    
