JohnDevine/ESP32-MQTT-Weather/src/main.c
                int sent = sendto(sock, response, pos, 0, (struct sockaddr *)&client_addr, addr_len);
                if (sent < 0) {
                    ESP_LOGW(TAG, "Failed to send DNS response: errno=%d", errno);
                } else {
                    ESP_LOGD(TAG, "DNS response sent (%d bytes)", sent);
                }
            } else {
                ESP_LOGW(TAG, "Invalid DNS query length: %d", qlen);
            }
        } else if (len < 0) {
            if (errno == EAGAIN || errno == EWOULDBLOCK) {
                // Timeout - this is expected, continue
                ESP_LOGV(TAG, "DNS socket timeout (expected)");
            } else {
                ESP_LOGE(TAG, "DNS socket error: errno=%d", errno);
                break;
            }
        }
        
        // Yield to other tasks periodically
        if (dns_requests_handled % 10 == 0) {
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }
    
    ESP_LOGI(TAG, "DNS hijack task shutting down gracefully (%lu requests handled)", dns_requests_handled);
    close(sock);
    vTaskDelete(NULL);
}

// Test function to manually trigger watchdog reset (for testing only)
void test_watchdog_reset() {
    ESP_LOGI(TAG, "=== TESTING WATCHDOG RESET ===");
    ESP_LOGI(TAG, "Current watchdog_reset_counter: %lu", watchdog_reset_counter);
    
    // Increment watchdog reset counter and save to NVS
    watchdog_reset_counter++;
    ESP_LOGI(TAG, "Incrementing watchdog reset counter to: %lu", watchdog_reset_counter);
    save_watchdog_counter_to_nvs();
    
    ESP_LOGI(TAG, "Test watchdog reset complete. Counter saved to NVS.");
}